Repository: Giving-Back-Studio/SacredSoundStudio-funkwhale
Catalog: docs/locales/*/LC_MESSAGES/user/accounts/avatar/delete.po
Languages: fr

source: Remove your avatar
fr: Supprimer votre avatar

source: If you don't want to have an avatar any more, you can remove it. To do this:
fr: Si vous ne souhaitez plus avoir d'avatar, vous pouvez le supprimer. Pour ce faire :

source: Desktop
fr: Bureau

source: Log in to your account.
fr: Connectez-vous à votre compte.

source: Select your avatar to expand the user menu.
fr: Sélectionnez votre avatar pour développer le menu utilisateur.

source: Select {guilabel}`Settings`.
fr: Sélectionnez {guilabel}`Paramètres`.

source: Scroll down to the {guilabel}`Avatar` section.
fr: Faire défiler jusqu'à la section {guilabel}`Avatar`.

source: Select {guilabel}`Remove`.
fr: Sélectionnez {guilabel}`Supprimer`.

source: Mobile
fr: Téléphone mobile

source: Select your avatar to open the {guilabel}`Options` menu.
fr: Sélectionnez votre avatar pour ouvrir le menu {guilabel}`Options`.

source: That's it! You've removed your avatar from your account. Other users will only see the initials of your username when they visit your profile.
fr: C'est fait ! Vous avez supprimé votre avatar de votre compte. Les autres utilisateurs ne verront que les initiales de votre nom d'utilisateur lorsqu'ils visiteront votre profil.
