Repository: Giving-Back-Studio/SacredSoundStudio-funkwhale
Catalog: docs/locales/*/LC_MESSAGES/administrator/index.po
Languages: fr

source: Get started
fr: Commencer

source: Follow the guides in this section to set up and administrate your pod.
fr: Suivez les guides dans cette section pour configurer et administrer votre pod.

source: Install Funkwhale on your server
fr: Installer Funkwhale sur votre serveur

source: Funkwhale is self-hosted, meaning you run it on your own server. To set up your own Funkwhale pod, check out [our installation guides](installation/index.md). Choose the installation method that works for you!
fr: Funkwhale est auto-hébergée, ce qui signifie que vous l’exécutez sur votre propre serveur. Pour configurer votre propre pod Funkwhale, suivez [nos guides d’installation](installation/index.md). Choisissez la méthode d’installation qui fonctionne pour vous !

source: Configure your Funkwhale pod
fr: Configurez votre pod Funkwhale

source: Once you've installed Funkwhale, you can use [the guides in this section](configuration/index.md) to configure it.
fr: Une fois que vous avez installé Funkwhale, vous pouvez utiliser [les guides dans cette section](configuration/index.md) pour le configurer.

source: Upgrade your Funkwhale pod
fr: Mettre à jour votre pod Funkwhale

source: Funkwhale releases new updates regularly. To keep up-to-date with these changes, check out our [upgrade guides](upgrade/index.md). If you're moving from our deprecated mono-container Docker setup, check out our [migration guide](migration.md).
fr: Funkwhale sort de nouvelles mises à jour régulièrement. Pour rester à jour avec ces modifications, suivez nos [guides de mises à jour](upgrade/index.md). Si vous venez de notre configuration dépréciée Docker mono-container, suivez nos [guides de migration](migration.md).

source: Manage your Funkwhale pod
fr: Gérer votre pod Funkwhale

source: Funkwhale provides tools for managing content and users on your Funkwhale pod. In addition to the [frontend moderation tools](../moderator/index.md), pod admins can use some extra tools for more powerful administration. Check out our [guide to the Django dashboard](django/index.md) and our [management script](manage-script/index.md) to get started.
fr: Funkwhale fournir des outils pour gérer le contenu et les utilisateurs de votre pod Funkwhale. En plus des [outils de modération de l’interface](../moderator/index.md), les administrateurs de pod peuvent utiliser certains outils supplémentaires pour une administration plus poussée. Suivez notre [guide du tableau de bord de Django](django/index.md) et notre [script de gestion](manage-script/index.md) pour commencer.
