Repository: Giving-Back-Studio/SacredSoundStudio-funkwhale
Catalog: docs/locales/*/LC_MESSAGES/user/libraries/edit.po
Languages: fr

source: Edit a library
fr: Modifier une bibliothèque

source: You can update the details of your libraries at any time. To do this:
fr: Vous pouvez mettre à jour les détails de vos bibliothèques à tout moment. Pour ce faire :

source: Desktop
fr: Bureau

source: Log in to your {term}`pod`.
fr: Connectez-vous à votre {term}`pod`.

source: Select the upload icon ({fa}`upload`) in the top of the sidebar.
fr: Sélectionnez l'icône de téléchargement ({fa}`téléversement`) en haut de la barre latérale.

source: Select {guilabel}`Get started` under {guilabel}`Upload third-party content in a library`.
fr: Sélectionnez {guilabel}`Démarrer` sous {guilabel}`Téléverser du contenu tiers dans une bibliothèque`.

source: A screen appears showing your upload quota and your libraries.
fr: Un écran s'affiche, indiquant votre quota de téléchargement et vos bibliothèques.

source: Select {guilabel}`Library Details` under the library you want to edit.
fr: Sélectionnez {guilabel}`Détails de la bibliothèque` sous la bibliothèque que vous voulez éditer.

source: Select the {guilabel}`✎ Edit` button at the top of the screen.
fr: Sélectionnez le bouton {guilabel}`✎ Modifier` en haut de l'écran.

source: Change any of the following:
fr: Modifier l'un des éléments suivants :

source: {guilabel}`Name`.
fr: {guilabel}`Nom`.

source: {guilabel}`Visibility`.
fr: {guilabel}`Visibilité`.

source: Select {guilabel}`Update Library` to save your changes. A toast notification appears at the bottom of the screen to confirm your changes.
fr: Sélectionnez {guilabel}`Mettre à jour la bibliothèque` pour sauvegarder vos changements. Une notification apparaît au bas de l'écran pour confirmer vos modifications.

source: Mobile
fr: Téléphone mobile

source: Select the upload icon ({fa}`upload`) at the top of the screen.
fr: Sélectionnez l'icône de ({fa}`téléversement`) en haut de l'écran.

source: That's it! You've updated your library's details.
fr: C'est fait ! Vous avez mis à jour les détails de votre bibliothèque.
