Repository: Giving-Back-Studio/SacredSoundStudio-funkwhale
Catalog: docs/locales/*/LC_MESSAGES/user/libraries/follow.po
Languages: es

source: Follow a library
es: Sigue una librería

source: Follow a library to get access to its content. There are two ways to follow a library:
es: Sigue una librería para acceder a su contenido. Hay dos formas de seguir una librería:

source: Use a sharing link
es: Usa un enlace para compartir

source: If you've received a sharing link, you can use this to follow a library. To do this:
es: Si has recibido un enlace para compartir, puedes usarlo para seguir una librería. Para esto:

source: Desktop
es: Escritorio

source: Log in to your pod.
es: Inicia la sesión en tu pod.

source: Select the upload icon ({fa}`upload`) in the top of the sidebar.
es: Selecciona el ícono de subir ({fa}`upload`) en la parte superior de la barra lateral.

source: Select {guilabel}`Get started` under {guilabel}`Follow remote libraries`. A screen appears showing you the libraries you are following.
es: Selecciona {guilabel}`Inicia` bajo {guilabel}`Sigue librerías remotas`. Aparecerá una pantalla mostrando las librerías que estás siguiendo.

source: Paste the sharing link into the {guilabel}`Search a remote library` search bar.
es: Pega el enlace para compartir en la barra de búsqueda {guilabel}`Busca una librería remota`.

source: Select the {guilabel}`Search` icon or hit {kbd}`⏎ Return` to search for the library. If the library exists, a library card appears.
es: Selecciona el ícono {guilabel}`Busca` o dale a {kbd}`⏎ Regresar` para buscar la librería. Si la librería existe, aparecerá una tarjeta.

source: Select {guilabel}`Follow` on the library card. If the library's privacy level is {guilabel}`Nobody except me`, the owner needs to approve the request.
es: Selecciona {guilabel}`Seguir` en la tarjeta de la librería. Si la privacidad de la librería es {guilabel}`Nadie excepto yo`, necesitarás que el dueño apruebe la solicitud.

source: Mobile
es: Móvil

source: Select the upload icon ({fa}`upload`) at the top of the screen
es: Selecciona el ícono de subir ({fa}`upload`) en la parte superior de la pantalla

source: That's it! The server then scans the content and you can see it on your {term}`pod`.
es: ¡Y listo! Entonces, el servidor escaneará el contenido y podrás verlo en tu {term}`pod`.

source: Follow from content on your pod
es: Seguir desde el contenido en tu pod

source: You can only follow a library from content pages if its privacy level is not {guilabel}`Nobody except me`.
es: Solamente puedes seguir una librería desde las páginas de contenido si su privacidad no es {guilabel}`Nadie excepto yo`.

source: If a user on your {term}`pod` has already followed a library, you can find it by selecting content from that library. To do this:
es: Si un usuario en tu {term}`pod` ya sigue una librería, puedes encontrarla seleccionando contenido de esa librería. Para esto:

source: Select a track, album, or artist from the library you want to follow.
es: Selecciona una pista, un álbum o un(a) artista de la librería que deseas seguir.

source: Scroll to the bottom of the page. The library card appears in the {guilabel}`User libraries` section.
es: Ve hasta el final de la página. La tarjeta de la librería aparecerá en la sección {guilabel}`Librerías de usuario`.

source: Select {guilabel}`Follow` on the library card.
es: Selecciona {guilabel}`Seguir` en la tarjeta de la librería.

source: You're done! The content will remain on the server even if the other user stops following the library.
es: ¡Listo! El contenido permanecerá en el servidor incluso si el otro usuario deja de seguir esa librería.
