Repository: Giving-Back-Studio/SacredSoundStudio-funkwhale
Catalog: docs/locales/*/LC_MESSAGES/administrator_documentation/upgrade_docs/debian.po
Languages: fr

source: Upgrade your Debian Funkwhale installation
fr: Mettre à jour votre installation Funkwhale sur Debian

source: If you installed Funkwhale following the [Debian guide](../installation_docs/debian), follow these steps to upgrade.
fr: Si vous avez installé Funkwhale suivant le [guide Debian](../installation_docs/debian), suivez ces étapes pour mettre à jour.

source: Download the updated files
fr: Téléchargez les fichiers mis à jours

source: SSH into your server.
fr: SSH dans votre serveur.

source: Log in as your `funkwhale` user.
fr: Connectez-vous comme votre utilisateur `funkwhale`.

source: Navigate to your Funkwhale directory.
fr: Naviguez jusque dans votre répertoire Funkwhale.

source: Stop the Funkwhale services.
fr: Arrêtez les services Funkwhale.

source: Export the Funkwhale version you want to update to. You'll use this in the rest of the commands in this guide.
fr: Exportez la version de Funkwhale vers laquelle vous voulez mettre à jour. Vous utiliserez ceci pour les commandes suivantes dans ce guide.

source: Download the API files for your chosen Funkwhale version.
fr: Téléchargez les fichiers API pour votre version de Funkwhale choisie.

source: Extract the downloaded archive to a new directory.
fr: Extrayez l’archive téléchargée dans un nouveau répertoire.

source: Remove the old `api` directory and move the extracted directory to the `api` directory.
fr: Supprimez l’ancien répertoire `api` et déplacé le répertoire extrait vers le répertoire `api`.

source: Remove the downloaded archive file.
fr: Supprimez le fichier archive téléchargé.

source: Update your Funkwhale instance
fr: Mettre votre instance Funkwhale à jour

source: Once you have downloaded the new files, you can update your Funkwhale instance. To do this:
fr: Une fois que vous avez téléchargé les nouveaux fichiers, vous pouvez mettre à jour votre instance Funkwhale. Pour ce faire :

source: Install or upgrade all OS dependencies using the dependencies script.
fr: Installez ou mettez à jour toutes vos dépendances systèmes avec le script de dépendances.

source: Enter the `api` directory to run the following commands.
fr: Entrez dans le répertoire `api`pour exécuter les commandes suivantes.

source: Install all Python dependencies using `poetry`.
fr: Installez toutes les dépendances Python en utilisant `poetry`.

source: Collect the new static files to serve.
fr: Collectez les nouveaux fichiers statiques à servir.

source: Apply new database migrations.
fr: Appliquez les nouvelles migrations de base de données.

source: Restart the Funkwhale services.
fr: Redémarrez les services Funkwhale.

source: That's it! You've updated your Funkwhale pod. You should now see the new version running in your web browser.
fr: Eh voilà ! Vous avez mis votre pod Funkwhale à jour. Vous devriez voir maintenant la nouvelle version s’exécuter dans votre navigateur web.
